01_Dummy_cases/02_A02_Rotor/03_RM/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    INLET
    {
        type            calculated;
        value           uniform 0;
    }
    OUTLET
    {
        type            calculated;
        value           uniform 0;
    }
    SHROUD
    {
        type            calculated;
        value           nonuniform List<scalar> 
4000
(
96.8648
96.8648
96.8648
96.8648
96.8648
96.8648
96.8647
96.8647
...
)
;
    }
    HUB
    {
        type            calculated;
        value           nonuniform List<scalar> 
4000
(
96.9619
96.9619
96.9619
96.9619
96.9619
96.9619
96.9618
96.9618
...
)
;
    }
    PER_1
    {
        type            cyclicAMI;
        value           uniform 0;
    }
    PER_2
    {
        type            cyclicAMI;
        value           uniform 0;
    }
}


// ************************************************************************* //
